Ismael-Stark/GitHub_Clases_UPPue/Microcontroladores/2022/PidCruceCeroCCS.X/PIC16F18857_registers.h
struct  {
   unsigned int PPSLOCKED:1;
} PPSLOCK;
#byte PPSLOCK = 0x1E8F

#byte INTPPS = 0x1E90

#byte T0CKIPPS = 0x1E91

#byte T1CKIPPS = 0x1E92

#byte T1GPPS = 0x1E93

#byte T3CKIPPS = 0x1E94

#byte T3GPPS = 0x1E95

#byte T5CKIPPS = 0x1E96

#byte T5GPPS = 0x1E97

#byte CCP1PPS = 0x1EA1

#byte CCP2PPS = 0x1EA2

#byte CCP3PPS = 0x1EA3

#byte CCP4PPS = 0x1EA4

#byte SMT1WINPPS = 0x1EA9

#byte SMT1SIGPPS = 0x1EAA

#byte SMT2WINPPS = 0x1EAB

#byte SMT2SIGPPS = 0x1EAC

#byte CWG1PPS = 0x1EB1

#byte CWG2PPS = 0x1EB2

#byte CLCIN0PPS = 0x1EBB

#byte CLCIN1PPS = 0x1EBC

#byte CLCIN2PPS = 0x1EBD

#byte CLCIN3PPS = 0x1EBE

#byte ADCACTPPS = 0x1EC3

#byte SSP1CLKPPS = 0x1EC5

#byte SSP1DATPPS = 0x1EC6

#byte SSP1SSPPS = 0x1EC7

#byte SSP2CLKPPS = 0x1EC8

#byte SSP2DATPPS = 0x1EC9

#byte SSP2SSPPS = 0x1ECA

#byte RXPPS = 0x1ECB

#byte TXPPS = 0x1ECC

#byte RA0PPS = 0x1F10

#byte RA1PPS = 0x1F11

#byte RA2PPS = 0x1F12

#byte RA3PPS = 0x1F13

#byte RA4PPS = 0x1F14

#byte RA5PPS = 0x1F15

#byte RA6PPS = 0x1F16

#byte RA7PPS = 0x1F17

#byte RB0PPS = 0x1F18

#byte RB1PPS = 0x1F19

#byte RB2PPS = 0x1F1A

#byte RB3PPS = 0x1F1B

#byte RB4PPS = 0x1F1C

#byte RB5PPS = 0x1F1D

#byte RB6PPS = 0x1F1E

#byte RB7PPS = 0x1F1F

#byte RC0PPS = 0x1F20

#byte RC2PPS = 0x1F22

#byte RC3PPS = 0x1F23

#byte RC4PPS = 0x1F24

#byte RC5PPS = 0x1F25

#byte RC6PPS = 0x1F26

#byte RC7PPS = 0x1F27

struct  {
   unsigned int ANSA:8;
} ANSELA;
#byte ANSELA = 0x1F38

struct  {
   unsigned int WPUA:8;
} WPUA;
#byte WPUA = 0x1F39

struct  {
   unsigned int ODCA:8;
} ODCONA;
#byte ODCONA = 0x1F3A

struct  {
   unsigned int SLRA:8;
} SLRCONA;
#byte SLRCONA = 0x1F3B

struct  {
   unsigned int INLVLA:8;
} INLVLA;
#byte INLVLA = 0x1F3C

struct  {
   unsigned int IOCAP:8;
} IOCAP;
#byte IOCAP = 0x1F3D

struct  {
   unsigned int IOCAN:8;
} IOCAN;
#byte IOCAN = 0x1F3E

struct  {
   unsigned int IOCAF:8;
} IOCAF;
#byte IOCAF = 0x1F3F

struct  {
   unsigned int CCDNA:8;
} CCDNA;
#byte CCDNA = 0x1F40

struct  {
   unsigned int CCDPA:8;
} CCDPA;
#byte CCDPA = 0x1F41

struct  {
   unsigned int ANSB:8;
} ANSELB;
#byte ANSELB = 0x1F43

struct  {
   unsigned int WPUB:8;
} WPUB;
#byte WPUB = 0x1F44

struct  {
   unsigned int ODCB:8;
} ODCONB;
#byte ODCONB = 0x1F45

struct  {
   unsigned int SLRB:8;
} SLRCONB;
#byte SLRCONB = 0x1F46

struct  {
   unsigned int INLVLB:8;
} INLVLB;
#byte INLVLB = 0x1F47

struct  {
   unsigned int IOCBP:8;
} IOCBP;
#byte IOCBP = 0x1F48

struct  {
   unsigned int IOCBN:8;
} IOCBN;
#byte IOCBN = 0x1F49

struct  {
   unsigned int IOCBF:8;
} IOCBF;
#byte IOCBF = 0x1F4A

struct  {
   unsigned int CCDNB:8;
} CCDNB;
#byte CCDNB = 0x1F4B

struct  {
   unsigned int CCDPB:8;
} CCDPB;
#byte CCDPB = 0x1F4C

struct  {
   unsigned int ANSC:8;
} ANSELC;
#byte ANSELC = 0x1F4E

struct  {
   unsigned int WPUC:8;
} WPUC;
#byte WPUC = 0x1F4F

struct  {
   unsigned int ODCC:8;
} ODCONC;
#byte ODCONC = 0x1F50

struct  {
   unsigned int SLRC:8;
} SLRCONC;
#byte SLRCONC = 0x1F51

struct  {
   unsigned int INLVLC:8;
} INLVLC;
#byte INLVLC = 0x1F52

struct  {
   unsigned int IOCCP:8;
} IOCCP;
#byte IOCCP = 0x1F53

struct  {
   unsigned int IOCCN:8;
} IOCCN;
#byte IOCCN = 0x1F54

struct  {
   unsigned int IOCCF:8;
} IOCCF;
#byte IOCCF = 0x1F55

struct  {
   unsigned int CCDNC:8;
} CCDNC;
#byte CCDNC = 0x1F56

struct  {
   unsigned int CCDPC:8;
} CCDPC;
#byte CCDPC = 0x1F57

#byte WPUE = 0x1F65

#byte INLVLE = 0x1F68

struct  {
   unsigned int :3;
   unsigned int IOCEP3:1;
} IOCEP;
#byte IOCEP = 0x1F69

struct  {
   unsigned int :3;
   unsigned int IOCEN3:1;
} IOCEN;
#byte IOCEN = 0x1F6A

struct  {
   unsigned int :3;
   unsigned int IOCEF3:1;
} IOCEF;
#byte IOCEF = 0x1F6B

struct  {
   unsigned int C_SHAD:1;
   unsigned int DC_SHAD:1;
   unsigned int Z_SHAD:1;
} STATUS_SHAD;
#byte STATUS_SHAD = 0x1FE4

#byte WREG_SHAD = 0x1FE5

#byte BSR_SHAD = 0x1FE6

#byte PCLATH_SHAD = 0x1FE7

#byte FSR0L_SHAD = 0x1FE8

#byte FSR0H_SHAD = 0x1FE9

#byte FSR1L_SHAD = 0x1FEA

#byte FSR1H_SHAD = 0x1FEB

#byte STKPTR = 0x1FED

#word TOS = 0x1FEE

